##################################
######       TAPS           ######
##################################

tap "homebrew/services"
tap "wata727/tflint"
tap "azure/functions"
tap "jakehilborn/jakehilborn" 
tap "ravenac95/sudolikeaboss"

##################################
######       FORMULA        ######
##################################

# Utility for manipulating HFS+ compressed files
brew "afsctool"
# Tool for reverse engineering 3rd party, closed, binary Android apps
brew "apktool"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Configuration editing tool and API
brew "augeas"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Azure Functions CLI
brew "azure-functions-core-tools@3"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# Display user-friendly message boxes from shell scripts
brew "dialog"
# macOS command line utility to configure multi-display resolutions and arrangements
brew "displayplacer"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Bash, Zsh and Fish completion for Docker
brew "docker-completion"
# Isolated development environments using Docker
brew "docker-compose"
# Completion script for docker-compose
brew "docker-compose-completion"
# Native C/C++ API Blueprint Parser
brew "fontforge"
# Software library to render fonts
brew "freetype"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# AVH edition of git-flow
brew "git-flow-avh"
# Easy semantic versioning for projects using Git
brew "gitversion"
# Core application library for C
brew "glib"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Smart font renderer for non-Roman scripts
brew "graphite2"
# OpenType text shaping engine
brew "harfbuzz"
# Kubernetes package manager
brew "helm@3"
# Add GitHub support to git on the command-line
brew "hub"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Asynchronous event library
brew "libevent"
# Portable Foreign Function Interface library
brew "libffi"
# Common error values for all GnuPG components
brew "libgpg-error"
# X.509 and CMS library
brew "libksba"
# Library for manipulating PNG images
brew "libpng"
# NaCl networking and cryptography library
brew "libsodium"
# TIFF library and utilities
brew "libtiff"
# Generic library support script
brew "libtool"
# YAML Parser
brew "libyaml"
# Creates dependencies in makefiles
brew "makedepend"
# Mac App Store command-line interface
brew "mas"
# Cross platform, open source .NET development framework
brew "mono"
# Manage multiple Node.js versions
brew "nvm"
# Regular expressions library
brew "oniguruma"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Framework for layout and rendering of i18n text
brew "pango"
# Simplistic interactive filtering tool
brew "peco"
# Low-level library for pixel manipulation
brew "pixman"
# Manage compile and link flags for libraries
brew "pkg-config"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Library for command-line editing
brew "readline"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# GNU Make with improved error handling, tracing, and a debugger
brew "remake"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Ruby version manager
brew "rbenv"
# Substitute for classic 'make' tool with autoconf/automake functionality
brew "scons"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# SQLite extension providing 256-bit AES encryption
brew "sqlcipher"
# Command-line interface for SQLite
brew "sqlite"
# 1password passwords on the terminal
brew "sudolikeaboss"
# Generate clients, server stubs, and docs from an OpenAPI spec
brew "swagger-codegen"
# Tool to build, change, and version infrastructure
brew "terraform"
# Linter for Terraform files
brew "tflint"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Auto-hinter for TrueType fonts
brew "ttfautohint"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# "General-purpose data compression with high compression ratios"
brew "xz"
# JavaScript package manager
brew "yarn"
# High-performance, asynchronous messaging library
brew "zeromq"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"


##################################
######       CASKS          ######
##################################

# Application launcher and productivity software
cask "alfred"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# android-sdk
cask "android-sdk"
# Memory training application
cask "anki"
# FreeMacSoft AppCleaner
cask "appcleaner"
# Backup and restore SD cards, USB drives, external HDD, etc
cask "applepi-baker"
# en-source electronics prototyping platform
cask "arduino"
# AWS Vault is a tool to securely store and access AWS credentials in a development environment.
cask "aws-vault"
# Azure Data Studio
cask "azure-data-studio"
# UI wireframing tool
cask "balsamiq-wireframes"
# Menu bar icon organizer
cask "bartender"
# Desktop casting/streaming app for Apple TV and Chromecast
cask "beamer"
# Tool to customize input devices and automate computer systems
cask "bettertouchtool"
# Compare files and folders
cask "beyond-compare"
# Utility that prevents the system from going to sleep
cask "caffeine"
# A tool to show Mac caps lock status.
cask "captin"
# Web debugging Proxy application
cask "charles"
# Color picking application
cask "colorsnapper"
# Allows switching between application windows
cask "contexts"
# Cyberduck is a libre server and cloud storage browser
cask "cyberduck"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# .net framework
cask "dotnet-sdk"
# Flowcharts
cask "drawio"
# App for note taking, organizing, task lists, and archiving
cask "evernote"
# Tool for running time-saving scripts
cask "fastscripts"
# Cross-platform web browser
cask "firefox"
# Hosts file editor/manager
cask "gas-mask"
# Tool to measure the computer system's performance
cask "geekbench"
# gfxCardStatus is an unobtrusive menu bar app for OS X that allows MacBook Pro users to see which apps are affecting their battery life by using the more power-hungry graphics.
cask "gfxcardstatus"
# Font Editor
cask "glyphs"
# Cross-platform web browser
# cask "google-chrome"
# Open-source video transcoder
cask "handbrake"
# iPhone management application
cask "imazing"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Open-source screen recorder built with web technology
cask "kap"
# Keyboard customizer
cask "karabiner-elements"
# Interface for reading and syncing eBooks
cask "kindle"
# Open-source Markdown editor
cask "macdown"
# Utility to combine binary content files after download
cask "macpar-deluxe"
# Free SNMP MIB Browser
cask "manageengine-mibbrowser"
# Microsoft Azure Storage Explorer
cask "microsoft-azure-storage-explorer"
# Multi-platform web browser
cask "microsoft-edge"
# MongoDB Compass
cask "mongodb-compass"
# Reverse Proxy
cask "ngrok"
# Collaboration platform for API development
cask "postman"
# Command-line shell and scripting language
cask "powershell"
# Quick look for provisioning profiles
cask "provisionql"
# Wireless screen-mirroring application
cask "reflector"
# Time optimising application
cask "rescuetime"
# Graphical client for Git version control
cask "sourcetree"
# SpeedCrunch is a high-precision scientific calculator
cask "speedcrunch"
# Spotify
cask "spotify"
# Mongo tool
cask "studio-3t"
# Sublime Merge
cask "sublime-merge"
# Text editor for code, markup and prose
cask "sublime-text"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Unpacks archive files
cask "the-unarchiver"
# Open-source code editor
cask "visual-studio-code"
# en-source cross-platform multimedia player
cask "vlc"
# Graphical network analyzer and capture tool
cask "wireshark"
# Video communication and virtual meeting platform
# cask "zoomus"
